build/ForkJoinPool-1-worker-1.log

19:15:18.354 from karate config file 
19:15:18.797 request:
1 > POST https://www.w3schools.com/xml/tempconvert.asmx
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 352
1 > Content-Type: text/xml; charset=UTF-8
1 > Host: www.w3schools.com
1 > SOAPAction: https://www.w3schools.com/xml/CelsiusToFahrenheit
1 > User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/">
      <Celsius>37</Celsius>
      </CelsiusToFahrenheit>
    </soap:Body>
    </soap:Envelope>

19:15:19.312 response time in milliseconds: 520.45
1 < 200
1 < Cache-Control: private, max-age=0,public
1 < Content-Type: text/xml; charset=utf-8
1 < Date: Thu, 03 Dec 2020 13:43:19 GMT
1 < Server: Microsoft-IIS/7.5
1 < Vary: Accept-Encoding
1 < X-AspNet-Version: 4.0.30319
1 < X-Frame-Options: SAMEORIGIN
1 < X-Powered-By: ASP.NET
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"><CelsiusToFahrenheitResult>98.6</CelsiusToFahrenheitResult></CelsiusToFahrenheitResponse></soap:Body></soap:Envelope>

19:15:19.344 assertion failed: assert evaluated to false: responseTime <= 500
19:15:19.359 after scenario inside config 
19:15:19.375 from karate config file 
19:15:19.375 request:
1 > POST https://www.w3schools.com/xml/tempconvert.asmx
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 359
1 > Content-Type: text/xml; charset=UTF-8
1 > Host: www.w3schools.com
1 > SOAPAction: https://www.w3schools.com/xml/CelsiusToFahrenheit
1 > User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/">
            <Celsius>50</Celsius>
        </CelsiusToFahrenheit>
    </soap:Body>
</soap:Envelope>

19:15:19.734 response time in milliseconds: 358.61
1 < 200
1 < Cache-Control: private, max-age=0,public
1 < Content-Type: text/xml; charset=utf-8
1 < Date: Thu, 03 Dec 2020 13:43:20 GMT
1 < Server: Microsoft-IIS/7.5
1 < Vary: Accept-Encoding
1 < X-AspNet-Version: 4.0.30319
1 < X-Frame-Options: SAMEORIGIN
1 < X-Powered-By: ASP.NET
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"><CelsiusToFahrenheitResult>122</CelsiusToFahrenheitResult></CelsiusToFahrenheitResponse></soap:Body></soap:Envelope>

19:15:19.750 after scenario inside config 
