src/stackoverflow/70176111/index.html

<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Document</title>
</head>

<body>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/axios/0.24.0/axios.min.js"
    integrity="sha512-u9akINsQsAkG9xjc1cnGF4zw5TFDwkxuc9vUp5dltDWYCSmyd0meygbvgXrlc/z7/o4a19Fb5V0OUE58J7dcyw=="
    crossorigin="anonymous" referrerpolicy="no-referrer"></script>

  <script>
    window.onload = function () {
      const xml = `
        <soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
          <soap12:Body>
            <FahrenheitToCelsius xmlns="https://www.w3schools.com/xml/">
              <Fahrenheit>75</Fahrenheit>
            </FahrenheitToCelsius>
          </soap12:Body>
        </soap12:Envelope>
      `;

      axios({
        method: 'get',
        url: 'http://localhost:3000/xml/tempconvert.asmx',
        headers: {
          'Content-Type': 'application/soap+xml',
        },
        data: xml,
        withCredentials: false,
      })
        .then((response) => console.log(response.data))
        .catch(console.error);

      axios({
        method: 'get',
        url: 'http://localhost:3000/api/todos/1',
      })
        .then((response) => console.log(response.data))
        .catch(console.error);
    }
  </script>
</body>

</html>